lvx/base/Catalogs/бит_мпд_НастройкиВнешнихПодключений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_мпд_НастройкиВнешнихПодключений</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидИнформационнойБазы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_мпд_ВидыИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасположениеБазы</Name>
					<Comment>Серверная/Файловая</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_мпд_ВидыРасположенияИнформационныхБаз</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Comment>Имя сервера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Comment>Имя базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Путь</Name>
					<Comment>Путь</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Comment>Пароль</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Enums/бит_мпд_ВидыРасположенияИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_мпд_ВидыРасположенияИнформационныхБаз</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файловая</Name>
					<Comment>Файловая база COM- соединение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Серверная</Name>
					<Comment>Серверная база COM - соединение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>RestСервис</Name>
					<Comment>Подключение к автоматическому REST-сервису</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Catalogs/бит_мпд_НастройкиВнешнихПодключений/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

// Процедура - обработчик события "ПриСозданииНаСервере" формы.
// 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
		
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 
	
	УправлениеЭлементамиФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

// Процедура - обработчик события "ПриИзменении" переключателя "РасположениеБазы".
// 
&НаКлиенте
Процедура РасположениеБазыПриИзменении(Элемент)
	
	ИзменениеРасположенияБазы();
	
КонецПроцедуры

// Процедура - действие команды "КомандаПроверитьПодключение".
// 
&НаКлиенте
Процедура КомандаПроверитьПодключение(Команда)
	
	Если ПроверитьПодключение() Тогда		
		ТекстСообщения = НСтр("ru='Тестовое подключение успешно выполнено.';en='Test connection is successful done.'");		
	Иначе		
		ТекстСообщения = НСтр("ru='Не удалось выполнить тестовое подключение.';en='Unable to test connection.'");		
	КонецЕсли; 
	
	ЗаголовокСообщения = НСтр("ru='Тестовое подключение';en='Test connection'");
	
	ПоказатьПредупреждение(, ТекстСообщения, 15, ЗаголовокСообщения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура устанавливает видимость доступность элементов формы.
// 
&НаСервереБезКонтекста
Процедура УправлениеЭлементамиФормы(Форма)
	
	Элементы = Форма.Элементы;
	Объект   = Форма.Объект;
	
	ЭтоСервернаяБаза = ?(Объект.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.Серверная, Истина, Ложь);
	ЭтоАвтоСервис    = ?(Объект.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.RestСервис,Истина, Ложь);
	
	Элементы.ИмяСервера.Видимость = ЭтоСервернаяБаза ИЛИ ЭтоАвтоСервис;
	Элементы.ИмяБазы.Видимость    = ЭтоСервернаяБаза ИЛИ ЭтоАвтоСервис;
	Элементы.Путь.Видимость       = НЕ ЭтоСервернаяБаза И НЕ ЭтоАвтоСервис;
	
КонецПроцедуры

// Процедура обрабатывает изменение реквизита РасположениеБазы.
// 
&НаСервере
Процедура ИзменениеРасположенияБазы()

  УправлениеЭлементамиФормы(ЭтотОбъект);	

КонецПроцедуры // ИзменениеРасположенияБазы()

// Функция производит тестовое подключение.
// 
// Возвращаемое значение:
//  флУдалось - Булево.
// 
&НаСервере
Функция ПроверитьПодключение()

	флУдалось = Ложь;
	Если Объект.РасположениеБазы = Перечисления.бит_мпд_ВидыРасположенияИнформационныхБаз.RestСервис Тогда
		
		 флУдалось = Справочники.бит_мпд_НастройкиВнешнихПодключений.ТестовоеСоедениеREST(Объект, "Ошибки");
		
	Иначе	
		
		Подключение = Справочники.бит_мпд_НастройкиВнешнихПодключений.ПодключитьКОМ(Объект,"Ошибки");
		
		Если Подключение = Неопределено Тогда
			
			флУдалось = Ложь;
			
		Иначе	
			
			флУдалось = Истина;
			
		КонецЕсли; 
		
		Подключение = Неопределено;
		
	КонецЕсли; 
	
	Возврат флУдалось;
	
КонецФункции // ПроверитьПодключение()

#КонецОбласти
